{
  "map": [
    {
      "tiles": {
        "0": {
          "url": "",
          "filename": "floor2-2014-v1.svg"
        },
        "1": {
          "url": "",
          "filename": "floor1-2014-v1.svg"
        },
        "2": {
          "url": "",
          "filename": "floor0-2014-v1.svg"
        }
      },
      "config": {
        "enableMyLocation": "false"
      },
      "markers": {
        "0": [
          {
            "lat": 37.78280631538293,
            "lng": -122.40401487797499,
            "type": "session",
            "id": "room8",
            "title": "Room 8"
          },
          {
            "lat": 37.78304877330107,
            "lng": -122.40369502454996,
            "type": "label",
            "id": "press",
            "title": "Press"
          },
          {
            "lat": 37.78311289865024,
            "lng": -122.40422375500204,
            "type": "label",
            "id": "keynote",
            "title": "Keynote"
          }
        ],
        "1": [
          {
            "lat": 37.783387683090886,
            "lng": -122.40415100008249,
            "type": "session",
            "id": "room1",
            "title": "Room 1"
          },
          {
            "lat": 37.783217830919796,
            "lng": -122.40386098623274,
            "type": "session",
            "id": "room2",
            "title": "Room 2"
          },
          {
            "lat": 37.783247243726194,
            "lng": -122.40433372557162,
            "type": "session",
            "id": "room3",
            "title": "Room 3"
          },
          {
            "lat": 37.783044533606585,
            "lng": -122.40409433841705,
            "type": "session",
            "id": "room4",
            "title": "Room 4"
          },
          {
            "lat": 37.78286938101629,
            "lng": -122.4043035507202,
            "type": "session",
            "id": "room5",
            "title": "Room 5"
          },
          {
            "lat": 37.78297351868808,
            "lng": -122.4038080126047,
            "type": "session",
            "id": "room6",
            "title": "Room 6"
          },
          {
            "lat": 37.78275146413703,
            "lng": -122.40409031510355,
            "type": "session",
            "id": "room7",
            "title": "Room 7"
          },
          {
            "lat": 37.78329705998422,
            "lng": -122.40366887301208,
            "type": "label",
            "id": "codelab",
            "title": "Code Lab"
          },
          {
            "lat": 37.782662033,
            "lng": -122.4037747,
            "type": "label",
            "id": "childcare",
            "title": "Childcare"
          },
          {
            "lat": 37.78325148340904,
            "lng": -122.40336142480373,
            "type": "partnerlabel",
            "id": "partnersandboxlabel",
            "title": "Partner\nSandbox"
          },
          {
            "lat": 37.78325148340904,
            "lng": -122.40336142480373,
            "type": "partner",
            "id": "partnersandboxmarker",
            "title": "Partner Sandbox"
          },
          {
            "lat": 37.78359357201673,
            "lng": -122.40373123437165,
            "type": "plainsession",
            "id": "dddsandbox",
            "title": "Design, Develop, Distribute"
          },
          {
            "lat": 37.78293854116584,
            "lng": -122.40343887358904,
            "type": "label",
            "id": "communitylounge",
            "title": "Community\nLounge"
          },
          {
            "lat": 37.783049568,
            "lng": -122.4045865,
            "type": "label",
            "id": "workshops",
            "title": "Workshops"
          }
        ],
        "2": [
          {
            "lat": 37.78381535905965,
            "lng": -122.40362226963043,
            "type": "label",
            "id": "northentrance",
            "title": "Entrance"
          },
          {
            "lat": 37.783153970642175,
            "lng": -122.40306705236436,
            "type": "label",
            "id": "eastentrance",
            "title": "Entrance"
          },
          {
            "lat": 37.78291495782711,
            "lng": -122.40424688905476,
            "type": "label",
            "id": "lunchroom",
            "title": "Breakfast / Lunch Cafes"
          },
          {
            "lat": 37.78336807459184,
            "lng": -122.40321557968855,
            "type": "label",
            "id": "bikeparking",
            "title": "Bike Parking"
          },
          {
            "lat": 37.78308163092494,
            "lng": -122.40339562296866,
            "type": "label",
            "id": "mothersroom",
            "title": "Mothers Room"
          },
          {
            "lat": 37.7836039061948,
            "lng": -122.40369737148283,
            "type": "label",
            "id": "regoinfo",
            "title": "Registration\nInformation Desk"
          },
          {
            "lat": 37.78331825838168,
            "lng": -122.40340635180475,
            "type": "label",
            "id": "gearpickup",
            "title": "Gear Pickup"
          },
          {
            "lat": 37.78369,
            "lng": -122.403923,
            "type": "label",
            "id": "glassbasecamp",
            "title": "Glass\nBasecamp"
          }
        ]
      }
    }
  ],
  "speakers": [
    {
      "bio": "Java Tech Lead and experienced coach. Expert in Java development, scalable architecture, Agile engineering practices and project management. Having more than 10 years of development experience, specializes on complex distributed scalable systems. Active participant and speaker of many international conferences. Founder and coach in training center XP Injection. Organizer and founder of Selenium Camp, JEEConf, XP Days Ukraine and IT Brunch conferences. Founder of active “Anonymous developers club” (uadevclub).",
      "name": "Mikalai Alimenkou",
      "company": "XP Injection / ZoralLabs, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/alimenkou.jpg",
      "id": "alimenkou"
    },
    {
      "bio": "Deals with stability-critical high-performance applications, including, but not limited to financial systems. A mutation analysis adept who also strives to raise the general awareness of HotSpot internals, mainly via articles and talks. Currently doing performance at Plumbr, Estonia.",
      "name": "Gleb Smirnov",
      "company": "Plumbr, Estonia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/smirnov.jpg",
      "id": "smirnov"
    },
    {
      "bio": "Primary focused on the development of complex distributed systems, R&D activities, but enjoys life beyond programming. Agile & lean practitioner, Certified Scrum Master and simply “great product-oriented” developer. Currently interested in microservices architecture, big data trends and searching of decent life partner. Founder of Morning@Lohika tech talks in Lviv.",
      "name": "Taras Matyashovskyy",
      "company": "Lohika, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/matyashovskyy.jpg",
      "id": "matyashovskyy"
    },
    {
      "bio": "Co-founder of Plumbr, the memory leak detection product, where he now contributes as core developer. Besides his daily technical tasks he is an active blogger, JavaOne RockStar and frequent conference speaker (Devoxx, JavaOne Russia, 33rd Degree, TopConf, JavaDay, GeekOut, Joker, Jazoon etc).\nPrior to founding Plumbr, Nikita was a Java EE developer and performance consultant in the Baltics, and has worked with tens of different Java EE applications over the years. In the last four years he specialized in troubleshooting and performance optimization.",
      "name": "Nikita Salnikov-Tarnovski",
      "company": "Plumbr, Estonia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/salnikov-tarnovski.jpg",
      "id": "salnikov-tarnovski"
    },
    {
      "bio": "Josh Long is the Spring Developer Advocate. Josh is the lead author on Apress’ Spring Recipes, 2nd Edition, the O’Reilly 'Pro Spring Roo' book, the Pearson 'Livelessons for Spring' and a committer on several Spring projects and the Activiti BPMN framework. When he’s not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. Josh’s interests include big-data, mobile, REST, NoSQL and integration. He blogs on the Spring blog and on his personal blog.",
      "name": "Josh Long",
      "company": "Pivotal, USA",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/long.jpg",
      "id": "long"
    },
    {
      "bio": "Attila Szegedi is a Principal Member of Technical Staff at Oracle, working on the Nashorn JavaScript runtime. He is also known for his work on Mozilla Rhino (another JavaScript runtime), a contributor to Kiji, Twitter’s server-optimized Ruby runtime, the author of Dynalink – the dynamic linker framework for languages on the JVM, as well as one of the principal developers of the FreeMarker templating language runtime.",
      "name": "Attila Szegedi",
      "company": "Oracle, Sweden",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/szegedi.jpg",
      "id": "szegedi"
    },
    {
      "bio": "Richard is an empirical technologist and solver of deep-dive technical problems and works independently as a Software Engineer and Trainer. Recently he has written a book on Java 8 Lambdas for O’Reilly and teaching people via java8training.com and Pluralsight. He’s worked as a developer in diverse areas including Statistical Analytics, Static Analysis, Compilers and Network Protocols. He is a leader in the London Java Community and runs Java Hackdays. Richard is also a known conference speaker, having talked at Devoxx, JavaOne, JFokus, Devoxx UK, Geecon, Oredev, JAX London and Codemotion. He obtained a PhD in Computer Science from The University of Warwick.",
      "name": "Richard Warburton",
      "company": "Monotonic Ltd, UK",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/warburton.jpg",
      "id": "warburton"
    },
    {
      "bio": "Yakov Fain is Java Champion and a co-founder of two software companies: Farata Systems and SuranceBay. He authored several technical books and lots of articles on software development. He leads Princeton Java Users Group. Recently Yakov co-authored the book 'Enterprise Web Development' (O’Reilly). Two of his books will be published this year: the second edition of 'Java 24-Hour Trainer' (Wrox) and Java For Kids' (No Starch Press, drafts are available here: http://yfain.github.io/Java4Kids_NoStarchPress/).",
      "company": "Farata Systems, USA",
      "plusoneUrl": "",
      "name": "Yakov Fain",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/fain.jpg",
      "id": "fain"
    },
    {
      "bio": "Works for SAP in the SAP JVM Technology group. He is an OpenJDK contributor from the very beginning and helped SAP and the SAP JVM team to engage in the OpenJDK project. He’s the project lead of the OpenJDK PowerPC/AIX porting project, a JDK 8 committer and JDK 9 reviewer.",
      "name": "Volker Simonis",
      "company": "SAP, Germany",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/simonis.jpg",
      "id": "simonis"
    },
    {
      "bio": "Java SE Performance Engineer. Before Oracle Dmitry had more than 10 years of production experience mixing Java with any kinds of hard techs.",
      "name": "Dmitry Chuyko",
      "company": "GOracle, Russia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/chuyko.jpg",
      "id": "chuyko"
    },
    {
      "bio": "Aleksey is the Java SE Performance Engineer working for Sun/Oracle for 5 years. The primary skills include performance engineering, benchmarking, JVMs, JITs, and class libraries. Maintains multiple projects, including jmh, jcstress, and jol. Prior joining Sun, Aleksey was employed by Intel where he worked in Apache Harmony performance team for 3+ years.",
      "name": "Aleksey Shipilёv",
      "company": "Oracle, Russia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/shipilev.jpg",
      "id": "shipilёv"
    },
    {
      "bio": "Baruch Sadogursky (a.k.a JBaruch) is the Developer Advocate of JFrog, the creators of Artifactory Binary Repository, the home of Bintray, JavaOne 2011 and 2013 Duke Choice Awards winner.\nFor a living he hangs out with the JFrog tech leaders, writes some code around Artifactory and Bintray, and then speaks and blogs about all that. He does it repeatedly for the last dozen of years and enjoys every moment of it.\nBaruch is @jbaruch on twitter and mostly blogs on http://www.jfrog.com/blog/.",
      "name": "Baruch Sadogursky",
      "company": "JFrog, Israel",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/sadogursky.jpg",
      "id": "sadogursky"
    },
    {
      "bio": "Since 2001 Evgeny was working as Java Developer, Team Leader, Java Architect and Java Trainer. Today he has his own consulting company.",
      "name": "Evgeny Borisov",
      "company": "Self employed, Israel",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/borisov.jpg",
      "id": "borisov"
    },
    {
      "bio": "Jacek Laskowski (twitter: @jaceklaskowski) is an independent IT professional offering services as a team and tech leader, open source software developer, technology advocate, course instructor, blogger, conference speaker, community leader and organiser, technical advisor and IT business liaison. Jacek is operating on the JVM platform with Scala and Java as the two main languages of choice, and helping people get the most out of it.\nHis resolution this year is to promote the Scala language in Poland as a leader of the Warsaw Scala Enthusiasts group and working with top-notch software houses in Poland. Jacek is the founder and a former leader of Warszawa Java User Group in Warsaw, Poland. In 2015 he was accepted to an exclusive group of passionate Java technology and community leaders who are community-nominated and selected under a project sponsored by Oracle and became a Java Champion.",
      "name": "Jacek Laskowski",
      "company": "Japila Software, Poland",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/laskowski.jpg",
      "id": "laskowski"
    },
    {
      "bio": "Ivar Grimstad is an experienced software architect focusing on Enterprise Java. He is member of the Java Community Process and in the Expert Groups for JSR 371 (MVC 1.0) and JSR 375 (Java EE Security API).\nHe has been working with Java since the beginning and has over the years tried out everything from lightweight mobile applications to large scale enterprise applications. His experience covers all aspects of designing architectures based on a variety of technologies including standard Java EE as well as more lightweight frameworks such as Spring and a variety of open source products.\nIvar is always focusing on quality and on using the right tools and technologies for the right task to optimize the software development process. Ivar is a frequent speaker at conferences, locally as well as internationally.",
      "name": "Ivar Grimstad",
      "company": "Cybercom, Sweden",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/grimstad.jpg",
      "id": "grimstad"
    },
    {
      "bio": "Nicolas Fränkel is a Software Architect with 12+ years experience in consulting for many different customers, in a wide range of contexts (such as telecoms, banking, insurances, large retail and public sector). He’s generally focused on Java and JavaEE technologies, but he’s narrowed interests like Software Quality, Build Processes and Rich Internet Applications.\nHe’s currently working for a eCommerce solution vendor leader. He also double as a teacher in universities and higher education schools, and a trainer for experienced pros, and triples as a book author.",
      "company": "Hybris, Switzerland",
      "plusoneUrl": "",
      "name": "Nicolas Fränkel",
      "id": "fränkel"
    },
    {
      "bio": "OMG, 30 years in technology! Hardware, assembler, C/C++ and almost 20 years of Java. From head of trading technology to global head of architecture in large investment banks, now co-founder and CTO of C24. Founded in 2000, sold to NASDAQ’s Iona Technologies in 2007 and bought back in 2011, C24 is a product company working mainly in the investment banking world with financial messaging standards. For the last few years C24 has been developing a new Java binding technology (SDO’s) that creates binary 'objects' but with a classic Java API. Full query resolution, less memory, fewer objects so less GC and significantly better performance.",
      "name": "John Davies",
      "company": "C24, UK",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/davies.jpg",
      "id": "davies"
    },
    {
      "bio": "Anton Keks is a software craftsman, co-founder of Codeborne, the only extreme programming shop in the region, frequent speaker at conferences, and a lecturer in Tallinn Technical University. He is also a strong believer in open-source software and agile development methodologies, author of a popular network tool – Angry IP Scanner, and a regular contributor to other open-source projects. Before founding Codeborne, Anton has led a team of developers of the award-winning internet-bank of Swedbank for 5 years, gradually introducing agile methods. During this time he has also co-founded Agile Estonia non-profit organization that organizes regular agile conferences in Estonia. During spare time he plays guitar, rides motorbike and travels to remote corners of the world.",
      "name": "Anton Keks",
      "company": "Codeborne, Estonia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/keks.png",
      "id": "keks"
    },
    {
      "bio": "Java developer for 8+ years. Worked for Oracle for 3 years (JCK Team, Java Platform group). Leader of the St. Petersburg Java User Group, and CodeFreeze community, organizer of Russian Java conferences JPoint and Joker. Interested in Java runtime, multithreaded programming, Java compatibility and software engineering trade-offs. Since 2015 Technology Evangelist at Odnoklassniki.",
      "company": "Odnoklassniki, Russia",
      "plusoneUrl": "",
      "name": "Alexey Fyodorov",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/fedorov.jpg",
      "id": "fyodorov"
    },
    {
      "bio": "Philipp Krenn is running everything database related and the general infrastructure of the Vienna based B2B startup ecosio. When not fighting MongoDB, MySQL, Jenkins, or AWS, he is giving NoSQL and cloud computing trainings or organizes his meetups ViennaDB and Papers We Love Vienna.",
      "name": "Philipp Krenn",
      "company": "Ecosio, Austria",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/krenn.jpg",
      "id": "krenn"
    },
    {
      "bio": "Active member of EPAM Kyiv Agile User Group and JUG KPI, actively participated in JEEConf, XPDays, AgileEE, JavaDay, EPAM SEC.",
      "name": "Izzet Mustafaiev",
      "company": "EPAM, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/mustafaiev.jpg",
      "id": "mustafaiev"
    },
    {
      "bio": "Embedded Telecom system engineer with more than 20 years of experience who has moved to enterprise Java area and quickly became leading Big Data solution architect with unique combination of knowledge. Current primary technology stack includes Apache Hadoop, HBase, ZooKeeper, Spark and is growing very fast. Ability to account many aspects of Big Data currently not so visible for normal enterprise Java architect because of previous history makes the difference.",
      "name": "Roman Nikitchenko",
      "company": "V.I.Tech, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/nikitchenko.jpg",
      "id": "nikitchenko"
    },
    {
      "bio": "Nikolay works on IntelliJ IDEA in JetBrains, where he tends to make the IDE more intelligent and powerful to allow developers, including himself, to be more productive in our day-to-day work.",
      "name": "Nikolay Chashnikov",
      "company": "JetBrains, Russia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/chashnikov.jpg",
      "id": "chashnikov"
    },
    {
      "bio": "Holger Kraus is a senior consultant at innoQ Deutschland GmbH. He has several years of experience in designing and developing large IT systems in different industries. Currently, his primary focus lies on architecture and implementation for distributed web applications within the Java Enterprise ecosystem.",
      "name": "Holger Kraus",
      "company": "innoQ, Germany",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/kraus.jpg",
      "id": "kraus"
    },
    {
      "bio": "Sergey works in IT since 2000 with 15 year of Java SE/EE experience. Occupied senior Java developer/Team Lead positions in more than 15 Java projects. Winner of 2013 JBoss Community Recognition Award. He participated as a speaker at 7 JUG events (6 in Odessa and 1 in Dnipropetrovsk). Has been working for more than 2 years as Java lecturer. Author of 'Development of Java applications' book.",
      "name": "Sergey Morenets",
      "company": "IT-School, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://storage.googleapis.com/iosched-updater-dev.appspot.com/images/speakers/__w-200-400-600-800-1000__/49b751fa-a5c6-e311-b297-00155d5066d7.jpg",
      "id": "morenets"
    },
    {
      "bio": "More than 14 years of professional experience in most of IT branches. Tons of languages and tools. Serhiy likes when it is done nicely, robust, useful, in time.",
      "name": "Serhiy Masyutin",
      "company": "Lohika, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/masyutin.jpg",
      "id": "masyutin"
    },
    {
      "bio": "Being a Java software architect, successful entrepreneur and acclaimed Agile speaker, Aviram Eisenberg combines a deep technical expertise with the managerial grid. On his entrepreneurial road he became a founder and CEO of Ignite – a global software development company with headquarters in Israel that specializes in Mobile, Web and Gaming Development. In Ukraine Ignite is present at Kyiv, Kharkov & Zhytomyr. For being active in a dev community he was chosen a chairman of the Israeli Software Development Forum.",
      "name": "Aviram Eisenberg",
      "company": "Ignite, Israel",
      "plusoneUrl": "https://plus.google.com/+FelipeHoffa",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/eisenberg.jpg",
      "id": "eisenberg"
    },
    {
      "bio": "Niko works as an independant and self-employed software architect, developer and trainer for Java and JavaScript enterprise solutions, integrations and web development. At the moment he is focussing on running Node.js applications in JVM environments and integrating best of both worlds.\nHe advises and supports clients across industries, conducts workshops, trainings and architecture reviews. Niko is a co-lead of a local Java User Group, writes articles and speaks regularly at international tech conferences. He is tweeting at @dasniko.",
      "company": "Freelancer, Germany",
      "plusoneUrl": "",
      "name": "Niko Köbler",
      "id": "köbler"
    },
    {
      "bio": "Java technical leader at Infopulse Ukraine. Production experience counts 13 years including about 11 years of Java development. Expert in Java и JavaScript. Smartass.",
      "company": "Infopulse, Ukraine",
      "plusoneUrl": "",
      "name": "Victor Polischuk",
      "id": "polischuk"
    },
    {
      "bio": "Nikita is an initiator and a team lead of Excelsior JET project – certified Java SE implementation with AOT compiler developed by Excelsior LLC. Working on the project since 1997 he took part in almost every activity of the project from the JVM core to product management and support. Last couple of years he is experimenting (in a spare time) with open source projects exploring approaches and a concept of the next web.",
      "name": "Nikita Lipsky",
      "company": "Excelsior LLC, Russia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/lipsky.jpg",
      "id": "lipsky"
    },
    {
      "bio": "Has 4 year experience working in the Java world starting from Intern in EPAM Systems to Senior Software Engineer today in the same company. Most of this time works in Big Data area, developing various extensions for Hadoop-family tools. Out of work, is fond of data science and Groovy language.",
      "name": "Yaroslav Yermilov",
      "company": "EPAM, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/yermilov.jpg",
      "id": "yermilov"
    },
    {
      "bio": "Alexander graduated from Saint-Petersburg State University in 2010, department of mathematics, he has a lot of prizes from international and regional mathematical competitions. In 2008, Alexander started to work for JetBrains, where he became Scala plugin for IntelliJ IDEA team leader. From 2012 he started teaching Scala in Saint-Petersburg Academic University.",
      "name": "Alexander Podkhalyuzin",
      "company": "JetBrains, Russia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/podkhalyuzin.jpg",
      "id": "podkhalyuzin"
    },
    {
      "bio": "Xavier Ducrohet is the Lead for the Android Developer Tools.",
      "name": "Xavier Ducrohet",
      "company": "",
      "plusoneUrl": "",
      "thumbnailUrl": "http://storage.googleapis.com/iosched-updater-dev.appspot.com/images/speakers/__w-200-400-600-800-1000__/ed6749ee-a5c6-e311-b297-00155d5066d7.jpg",
      "id": "ed6749ee-a5c6-e311-b297-00155d5066d7"
    },
    {
      "bio": "ava and Clojure developer. Passionate about practical functional programming, natural language processing and bigdata technologies. Maintain personal programming blog at mishadoff.com",
      "name": "Misha Kozik",
      "company": "Zoomdata, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/kozik.jpg",
      "id": "kozik"
    },
    {
      "bio": "Dmitriy is software engineer and geek at heart with passion to data analytics and data visualization. Also he is a great fan of functional programming. When not coding he can be found riding his road bike or playing bass guitar.",
      "name": "Dmitriy Morozov",
      "company": "Zoomdata, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/morozov.jpg",
      "id": "morozov"
    },
    {
      "bio": "Maciek Próchniak is algebraic topologist, for more than 8 years developing on JVM for food and pleasure. This includes various subjects varying from architecture to operations and from integration to web development. Recently trying hard to code more functionally, preferably in Scala. Likes to speak at conferences from Bergen to Cairo on wide range of topics – from Scala type system to noSQL databases. For 5 years happy @ TouK, and even more happy husband and father.",
      "company": "TouK, Poland",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/prochniak.jpg",
      "name": "Maciek Próchniak",
      "id": "próchniak"
    },
    {
      "bio": "Solutions Architect and R&D Engineer at ELEKS. Being a polyglot programmer, Yuriy is keen on exploring emerging technology and discovering hidden opportunities. He is an active member of Ukrainian IT community, being a frequent blogger at ELEKS R&D Blog, contributor to Lviv .NET User Group and teacher at Lviv Code School.",
      "company": "ELEKS, Ukraine",
      "plusoneUrl": "",
      "name": "Yuriy Guts",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/guts.jpg",
      "id": "gutz"
    },
    {
      "bio": "Nazmul is an developer & designer focused on creating awesome user experiences powered by Android & Cloud developer technologies. He is passionate about UX engineering, the design process, mobile computing, cloud computing, startups, and innovation. He created the UXD for Developers show on the Android Developers Channel on YouTube, started the UXD for Developers G+ community.",
      "name": "Nazmul Idris",
      "company": "Google",
      "plusoneUrl": "https://plus.google.com/+NazmulIdris",
      "thumbnailUrl": "http://storage.googleapis.com/iosched-updater-dev.appspot.com/images/speakers/__w-200-400-600-800-1000__/808084f3-22db-e311-b297-00155d5066d7.jpg",
      "id": "808084f3-22db-e311-b297-00155d5066d7"
    },
    {
      "bio": "Kyrylo has almost five years of professional experience in Java/Java EE development. He worked at NetCracker, Infopulse, Yandex before joining Grammarly team. Studied computer science at Yandex School of Data Analysis. His primary interests are machine learning and information retrieval.",
      "name": "Kyrylo Holodnov",
      "company": "Grammarly, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/holodnov.jpg",
      "id": "holodnov"
    },
    {
      "bio": "Maxim has 15 years of experience as a Java developer, team lead and software architect. His career started with projects involving J2EE and CORBA and now he has lots of experience with enterprise solutions, working as software architect and mentor for his team.",
      "name": "Maxim Ivanov",
      "company": "Laximo, Russia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/mivanov.jpg",
      "id": "ivanov"
    },
    {
      "bio": "Software designer, UNIX plumber, coach and consultant with 15 years of experience in IT industry. Has been involved in wide range of projects – from ERP and CRM systems to Massive Multiplayer Online Games and scalable solutions for media entertainment industry. Currently, he is researching new technology trends to rethink and change the business.",
      "name": "Igor Khotin",
      "company": "IntroPro, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/khotin.jpg",
      "id": "khotin"
    },
    {
      "bio": "Have been developing in Java for about 10 years. Switched to Scala 2 years ago and since then have forgotten about such things as NPE, iterator, debugger, return. Co-organizer of “Kyiv Club of Anonymous Developers”, Stage Coordinator at JEEConf.",
      "name": "Dmytro Mantula",
      "company": "GlobalLogic, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/mantula.jpg",
      "id": "mantula"
    },
    {
      "bio": "5+ years Java commercial expirience, 3+ years HBase commercial expirience, Oracle certified professional, Java instructor expirience. The main points of interest are design and development highload systems, statistic gathering and analytic systems, MMO game backends.",
      "name": "Valerii Moisieienko",
      "company": "Noosphere, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/moisieienko.jpg",
      "id": "moisieienko"
    },
    {
      "bio": "Graduated student of the Institute of Cybernetics. Scientific interests: domain specific languages, graphical languages. ",
      "name": "Vladimir Kozhaiev",
      "company": "Freelancer, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/kozhaiev.jpg",
      "id": "kozhaiev"
    },
    {
      "bio": "Java developer, researcher, R developer, focused by intelligence systems and software quality. Inspired by machine learning and prediction systems. Likes learning and sharing knowledge and tools, trying to make software development as much simple as possible through right tools and using these tools right.",
      "company": "IS Predict, Belarus",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/semeniuk.jpg",
      "name": "Olga Semeniuk",
      "id": "semeniuk"
    },
    {
      "bio": "Java developer in EPAM systems and work with BigData stack (Hadoop, ElasticSearch, Storm ….). Working credo is: 'BigData should be BIG'.",
      "name": "Andrii Golovei",
      "company": "EPAM, Ukraine",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/golovei.jpg",
      "id": "golovei"
    },
    {
      "bio": "Developer of MacroGroovy. Java geek with passion in compilers and language internals.",
      "name": "Sergei Egorov",
      "company": "TransferWise, Estonia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/egorov.jpg",
      "id": "egorov"
    },
    {
      "bio": "Anton is a software developer. He’s been developing enterprise applications for 8 years with Java and .NET technologies. He has a solid background developing rich Internet applications using various platforms. Currently he’s building insurance applications based on Java EE platform. Anton has a strong focus on Web technologies implementing best practices to make the front-end work seamlessly with the back-end. He’s a huge enthusiast of programming languages. ",
      "name": "Anton Moiseev",
      "company": "Farata Systems, Russia",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/moiseev.jpg",
      "id": "moiseev"
    },
    {
      "bio": "Developer, Java Tech Lead, trainer, owner of educational company.",
      "company": "GolovachCourses, Ukraine",
      "plusoneUrl": "",
      "name": "Ivan Golovach",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/golovach.jpg",
      "id": "b42d32e8-a5c6-e311-b297-00155d5066d7"
    },
    {
      "bio": "A programming junkie and computer history aficionado, Tomer’s been around the block a few times before settling at Wix as a system architect. In the last couple of years he’s developed a major crush on Scala, promoting it within the Israeli software industry as part of Java.IL (Israeli Java user group) and Underscore (Israeli Scala user group) and organizing the annual Scalapeño conference in Tel-Aviv.",
      "name": "Tomer Gabel",
      "company": "WIX, Israel",
      "plusoneUrl": "",
      "thumbnailUrl": "http://jeeconf.com/wp-content/uploads/speakers/gabel.jpg",
      "id": "gabel"
    }
  ],
  "blocks": [
    {
      "end": "2015-05-22T06:40:00.000Z",
      "title": "Registration and welcome coffee",
      "type": "break",
      "subtitle": "",
      "start": "2015-05-22T06:00:00.000Z"
    },
    {
      "end": "2015-05-22T07:00:00.000Z",
      "title": "Conference opening (Track A)",
      "type": "break",
      "subtitle": "",
      "start": "2015-05-22T06:40:00.000Z"
    },
    {
      "end": "2015-05-22T08:00:00.000Z",
      "title": "Break",
      "subtitle": "",
      "start": "2015-05-22T07:45:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-22T09:00:00.000Z",
      "title": "Break",
      "subtitle": "",
      "start": "2015-05-22T08:45:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-22T11:30:00.000Z",
      "title": "Lunch time",
      "subtitle": "",
      "start": "2015-05-22T09:45:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-22T12:30:00.000Z",
      "title": "Break",
      "subtitle": "",
      "start": "2015-05-22T12:15:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-22T14:00:00.000Z",
      "title": "Coffee break",
      "subtitle": "",
      "start": "2015-05-22T13:15:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-22T15:00:00.000Z",
      "title": "Closing of first conference day (Track A)",
      "subtitle": "",
      "start": "2015-05-22T14:45:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-22T17:00:00.000Z",
      "title": "Whiskey party",
      "type": "break",
      "subtitle": "Enjoy!",
      "start": "2015-05-22T15:00:00.000Z"
    },
    {
      "end": "2015-05-23T06:40:00.000Z",
      "title": "Registration and welcome coffee",
      "type": "break",
      "subtitle": "",
      "start": "2015-05-23T06:00:00.000Z"
    },
    {
      "end": "2015-05-23T07:00:00.000Z",
      "title": "Opening of the second conference day (Track A)",
      "type": "break",
      "subtitle": "",
      "start": "2015-05-23T06:40:00.000Z"
    },
    {
      "end": "2015-05-23T08:00:00.000Z",
      "title": "Break",
      "subtitle": "",
      "start": "2015-05-23T07:45:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-23T09:00:00.000Z",
      "title": "Break",
      "subtitle": "",
      "start": "2015-05-23T08:45:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-23T11:30:00.000Z",
      "title": "Lunch time",
      "subtitle": "",
      "start": "2015-05-23T09:45:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-23T12:30:00.000Z",
      "title": "Break",
      "subtitle": "",
      "start": "2015-05-23T12:15:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-23T14:00:00.000Z",
      "title": "Coffee break",
      "subtitle": "",
      "start": "2015-05-23T13:15:00.000Z",
      "type": "break"
    },
    {
      "end": "2015-05-23T15:20:00.000Z",
      "title": "Conference closing (Track A)",
      "type": "break",
      "subtitle": "",
      "start": "2015-05-23T14:50:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-22T07:00:00.000Z",
      "end": "2015-05-22T07:45:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-22T08:00:00.000Z",
      "end": "2015-05-22T08:45:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-22T09:00:00.000Z",
      "end": "2015-05-22T09:45:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-22T11:30:00.000Z",
      "end": "2015-05-22T12:15:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-22T12:30:00.000Z",
      "end": "2015-05-22T13:15:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-22T14:00:00.000Z",
      "end": "2015-05-22T14:45:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-23T07:00:00.000Z",
      "end": "2015-05-23T07:45:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-23T08:00:00.000Z",
      "end": "2015-05-23T08:45:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-23T09:00:00.000Z",
      "end": "2015-05-23T09:45:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-23T11:30:00.000Z",
      "end": "2015-05-23T12:15:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-23T12:30:00.000Z",
      "end": "2015-05-23T13:15:00.000Z"
    },
    {
      "title": "",
      "type": "free",
      "subtitle": "",
      "start": "2015-05-23T14:00:00.000Z",
      "end": "2015-05-23T14:45:00.000Z"
    }
  ],
  "partners": [],
  "sessions": [
    {
      "speakers": [
        "warburton"
      ],
      "description": "You may be hearing a lot of buzz around functional programming. For example, Java 8 recently introduced new features (lambda expressions and method references) and APIs (Streams, Optional and CompletableFutures) inspired from functional ideas such as first-class functions, composition and immutability. However, what does this mean for my existing codebase? In this talk we show how you can refactor your traditional object-oriented Java to using FP features and APIs from Java 8 in a beneficial manner. We will discuss things like: How to adapt to requirement changes using first-class functions. How you can enhance code reusability using currying. How you can make your code more robust by favouring immutability over mutability. How you can reduce null pointer exceptions with Optional.",
      "photoUrl": "",
      "url": "",
      "startTimestamp": "2015-05-22T07:00:00Z",
      "title": "Pragmatic Functional Refactoring with Java 8",
      "youtubeUrl": "",
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "endTimestamp": "2015-05-22T07:45:00Z",
      "color": "#3f51b5",
      "hashtag": "",
      "isLivestream": false,
      "captionsUrl": "",
      "id": "s1",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "room": "track-a"
    },
    {
      "speakers": [
        "salnikov-tarnovski"
      ],
      "description": "Correctly configured Garbage Collector is essential for application performance. Unfortunately, there are more than 200 JVM configuration parameters which influence GC in one way or another. Their very obscure names make your command line looks like a magic incantation. The goal of this talk is to demystify Garbage Collector optimisations. I will explain the basics of Garbage Collector tuning, starting from data collection and analysis. I will show how to formulate optimisation hypotheses, choose right parameters for it and verify if they worked. You will not become a GC expert, but you will not be afraid of GC tuning anymore.",
      "title": "First steps in GC tuning",
      "url": "",
      "startTimestamp": "2015-05-22T08:00:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s2",
      "color": "#2a56c6",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T08:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "szegedi"
      ],
      "description": "Nashorn, being part of OpenJDK is in unique position of being a JavaScript runtime embedded in the Java ecosystem. I’ll explain some of its under the hood workings (some of them are new in the just released Java 8u40). That understanding will let you get the most performance and functionality out of it when you use it to build Java+JS hybrid services and applications for the JVM.",
      "title": "Making This Rhinoceros Thunder",
      "url": "http://jeeconf.com/program/#nashorn",
      "startTimestamp": "2015-05-22T09:00:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s3",
      "color": "#558b2f",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "borisov",
        "sadogursky"
      ],
      "description": "Everyone knows, that Spring is one of the most powerful and useful frameworks for Java. So how deep are you familiar with it? (1) Level 1 – You know how to use Spring basic without understanding how it actually works under the hood. (2) Level 2 – You understand Spring internals, so you can customize it in accordance with the needs of your project. We offer you an upgrade to Level 3 – to obtain knowledge of very particular but important details about Spring. This session includes many intricate riddles about Spring, which were gathered from real production java projects. Solving them will help you to acquire very important knowledge about Spring and will protect you from different mystical bugs.",
      "title": "Spring Puzzlers",
      "url": "http://jeeconf.com/program/#spring-puzzlers",
      "startTimestamp": "2015-05-22T11:30:00Z",
      "photoUrl": "",
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s4",
      "color": "#607d8b",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T12:15:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "alimenkou"
      ],
      "description": "Every Java developer knows that concurrency is evil and it is very hard to write correct concurrent code, frequently it breaks all expectations. But what tasks do arise in real commercial Java project except traditional running peace of code async? In this talk I will present some tasks we solved in our projects and solutions we came to. It is practical journey to expand your horizons in applied Java concurrency.",
      "title": "Java Concurrency Applied",
      "url": "http://jeeconf.com/program/#java-concurrency-applied",
      "startTimestamp": "2015-05-22T12:30:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s5",
      "color": "#558b2f",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T13:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "fain"
      ],
      "description": "Software developers can be divided into two groups: those who think that their manager sucks, and those who believe that managers are not needed at all. Managers can be divided into two groups too: those who think that they know how to write software and those who know how to deliver the product. In this talk we’ll discuss all points of views to put your mind at ease and come up with a definition of a good manager and a good employee.",
      "title": "My manager sucks!",
      "url": "http://jeeconf.com/program/#my-manager-sucks",
      "startTimestamp": "2015-05-22T14:00:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s6",
      "color": "#0d904f",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T14:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "fyodorov"
      ],
      "description": "For the time beeing, there are 4(!) different types of Oracle JDK Updates: Critical Patch Update (CPU), Patch Set Update (PSU), Limited Update (LU) and Feature Release (FR). We will talk about differences between these types of updates, about reasons led Oracle to this model. As a result, you will understand what version of JDK/JRE you should use in production, in test environment and on your develment machine and what to expect from another JDK release.",
      "title": "JDK: CPU, PSU, LU, FR – WTF???",
      "url": "http://jeeconf.com/program/#jdk-versioning",
      "startTimestamp": "2015-05-22T07:00:00Z",
      "photoUrl": "",
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s7",
      "color": "#3367d6",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T07:45:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "laskowski"
      ],
      "description": "SThe talk is to introduce you to the world of reactive web programming in Scala using Spray toolkit (that’s soon to be Akka HTTP) and Play Framework. I’m going to show you how to get started and why you should have a special place for Spray/Akka HTTP and Play Framework in your toolbox. The talk is very Scala code heavy so expect a mixture of slides and IntelliJ IDEA.",
      "title": "Overview of reactive web application development in Scala with Spray/Akka HTTP and Play",
      "url": "http://jeeconf.com/program/#reactive-web-development-with-spray-akka-and-play",
      "startTimestamp": "2015-05-22T07:00:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s8",
      "room": "track-c",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T07:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "holodnov"
      ],
      "description": "NP-hard problems play an important role in cryptography and are frequent in graph theory. Large number of computers don’t reduce a complexity of an algorithm, but a solid architecture and design of distributed system can provide good scalability. In this talk, I will solve a non-standard NP-hard problem and will give examples how to solve it in a cluster of machines using Apache ZooKeeper.",
      "title": "Scaling a solution of an NP-hard problem in a cluster of machines using Apache ZooKeeper",
      "url": "http://jeeconf.com/program/#scaling-np-hard-problem-with-zookeeper",
      "startTimestamp": "2015-05-22T07:00:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s9",
      "color": "#558b2f",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T07:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "moiseev"
      ],
      "description": "Have you ever felt irritated that you needed to enter your address on a Web site to find the nearest post office or a movie theatre? Modern Web applications must use geolocation API to automate discovery of the user’s current location. This can dramatically improve the user experience. It’s not just about convenience, the more your app can find out automatically, the more likely people will use it. In this presentation I will discuss different approaches for determining the user’s location on the client side of a Web application. We’ll talk about practical challenges like concurrent requests, timeouts, inaccurate data, dirty data and fallback options. We’ll also look at some technical aspects like futures, async functions and generators. This talk is based on our experience gained while developing and deploying a Web application in production. All code examples will be given in Dart programming language, which directly matches the upcoming syntax of new JavaScript version (a.k.a. ES6).",
      "title": "Know Your User’s Location",
      "url": "http://jeeconf.com/program/#geo-api-usage",
      "startTimestamp": "2015-05-22T07:00:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s10",
      "color": "#558b2f",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T07:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "smirnov"
      ],
      "description": "Most engineers face problems that are new to them from time to time. Sometimes reading the docs is enough to solve it. Sometimes, there is someone who can help you out. Some other times, you have to dig in by yourself. When things get as deep as JVM, many engineers tend to back down. But come on, HotSpot is not a mysterious machine. It is opensource, after all! All the seemingly weird JVM behavior can be reproduced, and explained if one goes just a bit deeper. This talk will take the audience to the fun world of the JVM sources and review several case studies that are initially puzzling, but are actually quick to be dissolved. ",
      "title": "Just what are you doing, HotSpot?",
      "url": "http://jeeconf.com/program/#hotspot-internals",
      "startTimestamp": "2015-05-22T08:00:00Z",
      "photoUrl": "",
      "id": "s11",
      "room": "track-b",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T08:45:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "kozik"
      ],
      "description": "Clojure is a great language, especially for writing DSLs. Talk overviews DSL examples, common problems and approaches to their solving. Also we will discuss Instaparse, Clojure library which makes context-free grammars as easy to use as regular expressions.",
      "title": "DSL in Clojure",
      "url": "http://jeeconf.com/program/#dsl-in-clojure",
      "startTimestamp": "2015-05-22T08:00:00Z",
      "photoUrl": "",
      "youtubeUrl": "",
      "id": "s12",
      "room": "track-c",
      "isLivestream": true,
      "endTimestamp": "2015-05-22T08:45:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "krenn"
      ],
      "description": "Morphia is MongoDB’s JPA-like Object-Document Mapping (ODM). However, there is no object-relational impedence mismatch since documents fit the concept of object-orientation much better. This removes a lot of JPA pain, which makes database interactions fun again. On a practical level we take a look at the available annotations and how to map your objects as well as how to easily query data in MongoDB. Next we discuss some patterns on how to solve common requirements, such as the proper use of generics, auto-increments, and the encryption of sensitive data. The talk concludes with some tips and lessons we’ve learned from using Morphia in production for three years.",
      "title": "Painfree Object-Document Mapping for MongoDB",
      "url": "http://jeeconf.com/program/#object-document-mapping-for-mongodb",
      "startTimestamp": "2015-05-22T08:00:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s13",
      "color": "#0288d1",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T08:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "ivanov"
      ],
      "description": "We’ll talk about how development methodology has changed in the Java world for the last 15 years. You will see examples of architectural mistakes, frequently involving buzzword heavy hyped technologies, like “NoSQL”, “Microservices” and so on. Often popular “innovative approaches” aren’t more than yet another viewpoint to a known technological business problem. If you are responsible for architectural decisions, the thought “Hey, I’ve seen something like it before!” is helpful and gives you a chance to avoid inventing the wheel from scratch once again.",
      "title": "Hey, I’ve seen something like it before!",
      "url": "http://jeeconf.com/program/#reinventing-the-wheel",
      "startTimestamp": "2015-05-23T09:00:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s14",
      "color": "#558b2f",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "fain"
      ],
      "description": "From the software development perspective Internet of Things (IoT) is about programming sensors, connecting them with each other and integrating them with existing business applications. While IoT-enabled devices can use a variety of proprietary software, RESTful Web services and OAUTH protocol play a role of a glue that allows to integrate multiple devices into an application workflow. This presentation will demonstrate a sample architecture of such an application. You’ll also see a live demo of using commercial consumer devices as a part of an application that utilizes REST API, OAuth, Websockets, JavaScript and Java. This presentation will give you an idea of how to authenticate users and integrate new IoT devices as they become available on the market.",
      "title": "RESTful services and OAUTH protocol in IoT",
      "url": "http://jeeconf.com/program/#restful-services-and-oauth",
      "startTimestamp": "2015-05-22T09:00:00Z",
      "photoUrl": "",
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s15",
      "color": "#558b2f",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T09:45:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "guts"
      ],
      "description": "Whenever a functional language is mentioned, everyone talks about typical applications like DSL, parsing, data mining, or scientific computing. But what about mainstream consumer-facing applications? Can you build your next project with Scala? What if your system must run in the cloud, on desktop computers, and on specialized hardware, can you still do it? We’ll share our experience of implementing such a system for a German fitness startup that utilized custom-built devices, biometrics, cross-platform integration, and, of course, Scala. We’ll discuss the challenges we ran into and pitfalls you can avoid when your team decides to go functional.",
      "title": "Lessons from Implementing a Modern B2C System in Scala",
      "url": "http://jeeconf.com/program/#lessons-from-b2c-impelemtation-in-scala",
      "startTimestamp": "2015-05-22T09:00:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s16",
      "color": "#8e24aa",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "masyutin"
      ],
      "description": "Your project got data. Big data. Your business wants using it. On regular basis. Today data varies from mobile app logs to video streams and business needs assistance now and then. How can you get support from technology? You will learn how In-Memory Data Grid, Massively Parallel Processing and Map-Reduce can help. Also you’ll get an overview of a real life use case when sensor data is analized with HP Vertica, Java and R.",
      "title": "Big Data analysis approaches in Java world",
      "url": "http://jeeconf.com/program/#big-data-analysis",
      "startTimestamp": "2015-05-22T09:00:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s17",
      "color": "#3367d6",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "lipsky"
      ],
      "description": "A modern internet service is not just a web client today. It is common to write native mobile clients at least for the major platforms (iOS/Android). And this trend is extending to the desktop as well, forcing ISVs to look for cross-platform solutions. Now recall that Java offers a variety of rich UI frameworks, from Swing to JavaFX, for all major desktop platforms right now. However, to be called a native client, an application written in Java should deliver native user experience: it should install in a native manner, come with no external dependencies, look good, start and work fast, and not consume too much memory. In this talk we will consider how these requirements are addressed by different Java implementations and solutions.",
      "title": "Delivering Native User Experience in Client-Side Java Applications",
      "url": "http://jeeconf.com/program/#native-user-experience-in-client-side-java-applications",
      "startTimestamp": "2015-05-22T09:00:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s18",
      "color": "#607d8b",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "fyodorov"
      ],
      "description": "This talk will introduce you in disadvantages of locking, CAS operations, Java atomic variable classes and a couple of nonblocking algoritms: nonblocking stack and nonblocking queue. If we have time, we will also talk about ABA problem. The talk is based on JCIP (§15) and TAoMP (§§ 5, 7, 10, 11). It will be interesting for Java programmers who have heard about CAS and lock-free, but who have no experience in writing non-blocking code.",
      "title": "Atomics, CAS, and Nonblocking Algorithms",
      "url": "http://jeeconf.com/program/#nonblocking-algorithms",
      "startTimestamp": "2015-05-22T11:30:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s19",
      "color": "#3367d6",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T12:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "gabel"
      ],
      "description": "So you’ve heard of this newfangled “Scala” thing and think it might be worth checking out. Good for you! Unfortunately, it’s also daunting. Your first search for Scala is likely to pitch it as a “statically-typed hybrid object-oriented and functional language”, which is technically true but doesn’t really help much. Instead, this talk will provide an overview of the language, focusing on five highly practical advantages Scala has over Java without a brain hemorrhage-inducing paradigm shift, followed by some tips and recommendations on Scala adoption in the real world and (as time allows) open-ended Q&A.",
      "title": "5 Bullets to Scala Adoption",
      "url": "http://jeeconf.com/program/#5-bullets-to-scala-adoption",
      "startTimestamp": "2015-05-22T11:30:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s20",
      "color": "#558b2f",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T12:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "golovei"
      ],
      "description": "Elastic stack is very popular in over days. Lets go dive to world of near real time search. Make Hadoop search faster, ship a huge log data and visualize it with Elastic products. Configure ElasticSearch, Logstash, ES Hadoop in pair, describe all interesting features and differences with another systems.",
      "title": "Elastic stack in BigData",
      "url": "http://jeeconf.com/program/#elastic-stack-in-bigdata",
      "startTimestamp": "2015-05-22T11:30:00Z",
      "photoUrl": "",
      "youtubeUrl": "https://google.com/events/io",
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s21",
      "color": "#0d904f",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T12:15:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "warburton",
        "szegedi",
        "smirnov",
        "salnikov-tarnovski",
        "simonis"
      ],
      "description": "JVM Q&A Panel. Capacity: 100 people.",
      "title": "JVM Q&A Panel",
      "url": "",
      "startTimestamp": "2015-05-22T11:30:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s22",
      "color": "#00897b",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T12:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "grimstad"
      ],
      "description": "JSR 371: Model-View-Controller (MVC 1.0) Specification is targeted to be a part of the upcoming Java EE 8 release. In this session I will quickly go through the nuts and bolts of this JSR. I will then jump right into a demo showing the key concepts by building an application based on MVC 1.0 from scratch. As we go I will also make a quick comparison with other frameworks, such as Spring MVC. This session will be based on a live coding demo backed by a set of introductory slides.",
      "title": "MVC 1.0 by Example",
      "url": "http://jeeconf.com/program/#mvc-1-by-example",
      "startTimestamp": "2015-05-22T12:30:00Z",
      "photoUrl": "",
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s23",
      "color": "#00897b",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T13:15:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "laskowski",
        "sadogursky",
        "mantula",
        "podkhalyuzin",
        "gabel"
      ],
      "description": "JVM Languages Q&A Panel",
      "title": "JVM Languages Q&A Panel",
      "url": "",
      "startTimestamp": "2015-05-22T12:30:00Z",
      "photoUrl": "",
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s24",
      "color": "#558b2f",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T13:15:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "morozov"
      ],
      "description": "The talk will compare Cascalog, fully-featured data processing and querying library on top of Hadoop, and Sparkling – A Clojure API for Apache Spark. How both of these compare in terms of performance and code complexity for Big Data processing and why you shouldn’t be writing MapReduce jobs in plain Hadoop API.",
      "title": "ETL all the things!",
      "url": "http://jeeconf.com/program/#etl-all-the-things",
      "startTimestamp": "2015-05-22T12:30:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "id": "s25",
      "room": "track-d",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T13:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "fränkel"
      ],
      "description": "Spring Boot is a product from Spring, that provides many configuration defaults for a new Spring project, so that one can set up a project in minutes. However, this is only one of the many features of Spring Boot. One of its module also provides many important Non-Functional Requirements out-of-the-box: monitoring, metrics, exposing those over HTTP, etc. In this presentation, I’ll demo some of those, that will make DevOps more than a little happy.",
      "title": "Spring Boot for Devops",
      "url": "http://jeeconf.com/program/#spring-boot-for-devops",
      "startTimestamp": "2015-05-22T12:30:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s26",
      "color": "#607d8b",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T13:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "simonis"
      ],
      "description": "Java is often criticized for not supporting C-style structs. This makes it hard to efficiently implement certain types of data structures like for example arrays of small objects. However, recently this problem has been addressed by several different approaches. My talk will briefly introduce Packed Objects , an extension available in IBM’s Java SDK 8, Object Layout , a layout-optimized Java data structure package proposed by Gil Tene and Value Types , an OpenJDK proposal for small, immutable, identityless value types. I will describe the commonalities and differences of the three approaches and explain how they can improve the memory overhead and locality of Java objects. Finally I will deep-dive into the implementation of the Object Layout library and explain how it can be transparently intrinsified and optimized in the HotSpot VM. Attendees of my talk will become familiar with the development of an emerging Java technology. The will also get a good impression of what it means to implement such an extension in the Java Virtual machine and gain some insights into the HotSpot VM.",
      "title": "Packed Objects, Object Layout & Value Types — a Survey",
      "url": "http://jeeconf.com/program/#packed-objects-object-layout-and-value-types",
      "startTimestamp": "2015-05-22T14:00:00Z",
      "photoUrl": "",
      "youtubeUrl": "",
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s27",
      "color": "#558b2f",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": true,
      "endTimestamp": "2015-05-22T14:45:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "keks"
      ],
      "description": "I am pleased to tell you about the architecture of an online banking platform based on Play Framework and PSJ – Plain Simple Java. I will show why it’s better, faster and cheaper than building on the overused Java Enterprise stack. Online banking solutions on this platform now serve Bank Saint Petersburg and UBRD in Yekaterinburg, both of which have won many awards right after launch. Play Framework greatly helped to give a quick start and put architecture on the right track, but of course the real life has made some corrections, especially related to integration with backend systems: online bank is responsible for the overall user experience, so it must work around any flaws of IT systems in the bank and outdated legal requirements. I will talk about what is particularly good about Play Framework and what we had to do differently, as well as how Agile practices help us to fight poorly designed backend-systems.",
      "title": "Building an Enterprise-less online bank",
      "url": "http://jeeconf.com/program/#enterprise-less-online-bank",
      "startTimestamp": "2015-05-22T14:00:00Z",
      "photoUrl": "",
      "youtubeUrl": "",
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s28",
      "color": "#0288d1",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": true,
      "endTimestamp": "2015-05-22T14:45:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "matyashovskyy"
      ],
      "description": "This presentation will be useful to those who would like to get acquainted with Apache Spark architecture, top features and see some of them in action, e.g. RDD transformations and actions, Spark SQL, etc. Also we will cover real life use cases related to one of ours commercial projects and recall roadmap how we’ve integrated Apache Spark into it.",
      "title": "Introduction to Real-Time Big Data with Apache Spark",
      "url": "http://jeeconf.com/program/#apache-spark",
      "startTimestamp": "2015-05-22T14:00:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s29",
      "color": "#2a56c6",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T14:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "próchniak"
      ],
      "description": "Microservices are today’s hype. It seems that if you’re not doing them – you’re old fashioned and Doing It Wrong. But to do it properly you have to work in certain environment – ‘you have to be That tall’ as Martin Fowler wrote. In particular if you ignore things Conway’s law you’ll fail miserably. In this talk I’d like to tell you about our (small agile software house working for Big Company) experiences – when is it possible to change the company you’re working for and when it’s better to accept its constraints – and what can you do to make it still a bit better place to live – which rules and practices seen on Netflix gorgeous talks can be easily used and which are more problematic. Be aware that I’ll use old-fashioned words like OSGi, but I’ll try to omit most technical details and focus more on bigger picture – how we tried to move from good (?) old ESB towards fashionable microservices and where and why we decided to stay.",
      "title": "Microservices, ‘Enterprise’ and Conway’s law ",
      "url": "http://jeeconf.com/program/#microservices-enterprise-conways-law",
      "startTimestamp": "2015-05-22T14:00:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s30",
      "color": "#607d8b",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-22T14:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "long"
      ],
      "description": "We get it already! Microservices help you build smaller, singly-focused services, quicker. They scale out. They’re more agile because individual teams can deliver them at their own pace. They work well in the cloud because they’re smaller, and benefit from elastic, horizontal scaling. But what about the complexity? There’s a cost associated with adding services and coordinating the interactions between them. In this talk, we’ll look at Spring Cloud, which builds atop Spring Boot and the Netflix OSS stack, and see how it lets you easily integrate service-discovery, security, reliability patterns like the circuit breaker, and centralized and journaled property configuration (and more) to build resilient microservices that scale. We’ll look at service discovery and registration with a Eureka service registry and Spring Cloud’s Eureka integration, centralized, journaled configuration with Spring Cloud’s Config server, refreshing bean configuration in-situ with the `@RefreshScope`, building an API gateway using Zuul and reactive programming, and isolating failure cascades using the Hystrix circuit-breaker.",
      "title": "Building 'Bootiful' Microservices with Spring",
      "url": "http://jeeconf.com/program/#building-bootiful-microservices-with-spring",
      "startTimestamp": "2015-05-23T07:00:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s31",
      "color": "#8e24aa",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T07:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "sadogursky"
      ],
      "description": "With tens of millions of clients continuously downloading binaries from our repositories, we decided to offer an OSS client that natively supports these downloads. In this talk, we will share the main challenges in developing a highly-concurrent, resumable, async download library on top of Apache HTTP client. We will cover other libraries we tested and why we decided to reinvent the wheel. We will see important pitfalls we came across when working with HTTP and how using the right combination of techniques can improve performance by an order of magnitude. We will also see why your initial assumptions may completely change when faced with other players on the network. Consider yourself forewarned: lots of HTTP internals, NIO and concurrency ahead!",
      "title": "Everything you wanted to know about writing async, high-concurrency HTTP applications in Java, but were afraid to ask",
      "url": "http://jeeconf.com/program/#async-http-in-java",
      "startTimestamp": "2015-05-23T07:00:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s32",
      "color": "#2a56c6",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T07:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "yermilov"
      ],
      "description": "Domain-specific languages (aka DSLs) brings their creators to the new level of abstractions power. They indulge two primary desires of each developer: to play with challenging and interesting problems and to make future tasks easier and more pleasant to work with. What usually stops everyone from implementing really nice DSL is either poorness or complexity of instruments for their creation. Groovy is modern JVM language which features makes it first choice for simple and enjoyable DSLs implementing. In this talk, we will look at the instruments that Groovy provide for DSL builders and use it for creating our own DSL. We will cover features ranging from what Groovy can suggest for standard Java developer to transform his ugly Java DSL into something acceptable in 5 minutes to advanced features like Metaobject protocol and AST transformations.",
      "title": "Building domain-specific languages with Groovy",
      "url": "http://jeeconf.com/program/#building-dsl-with-groovy",
      "startTimestamp": "2015-05-23T07:00:00Z",
      "photoUrl": "",
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s33",
      "color": "#607d8b",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T07:45:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "captionsUrl": ""
    },
    {
      "speakers": [
        "mustafaiev"
      ],
      "description": "The world of old-school approaches to develop software look like are going away. We have no rights to ignore errors that might never happen; connections that might never will be broken or interrupted, processes that might never be killed; networks that might never be slow and this list could continue further… Let’s endue our software with capabilities to survive in the wild world of reality. In this talk I’m going to depict fault tolerance concepts and patterns, to provide guidance for implementing resilient software.",
      "title": "Fault tolerance – look, it’s possible!",
      "url": "http://jeeconf.com/program/#fault-tolerant-development",
      "startTimestamp": "2015-05-23T07:00:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s34",
      "color": "#646464",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T07:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "eisenberg"
      ],
      "description": "Is the good time of Java world “Write once, run anywhere” coming back? Codename One is the only Java iOS tool that currently comes close to this concept. Java bytecode is translated to native C/ObjC code and compiled using Xcode for seamless mobile application development. We will review this open-source platform and see its capabilities.",
      "title": "'Codename One' – Java to Obj-C bridge",
      "url": "http://jeeconf.com/program/#codename-one-java-to-objective-c-bridge",
      "startTimestamp": "2015-05-23T07:00:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s35",
      "color": "#646464",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T07:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "davies"
      ],
      "description": "Java was designed to abstract the hardware, the memory, disk and network, today we write programs without worrying about how the memory is used. As volumes get larger we’ve tended to scale horizontally with distributed computing but there is a lot more we can do to scale both before and after distributing that can give us over an order of magnitude in performance. Twenty to thirty years ago programmers spend most of their time getting incredible amounts of functionality from just a few kilobytes of RAM, much of these techniques appear to have been forgotten as we now happily walk around with gigabytes in our pockets. By turning your Java into binary, for example using just 2 bytes to store a date rather than Java’s Date we use 24 times less memory, add a lot of similar savings up and put them into a single byte[] and the savings for both memory and serialisation can be over 2 orders of magnitude. John will walk through simple examples (with code demos) before moving on to more complex XML example & more demos. Finally using Java 8 lambdas John will demonstrate complex XML processing on a big-data scale but on a laptop.",
      "title": "Speed up Your Java by Turning it into Binary",
      "url": "http://jeeconf.com/program/#speed-up-your-java-turning-it-into-binary",
      "startTimestamp": "2015-05-23T08:00:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s36",
      "color": "#646464",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T08:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "chuyko"
      ],
      "description": "Many have said that Java has no future. But it is now 2015, the new APIs and trendy lambda dances in Java 8. And a crowd of advanced neighbors​​ that have their own means of asynchronous processing for ‘going to production quickly.” Let’s talk about other languages ​​and libraries a bit. For a long time we already have Future and ExecutorService for asynchronous execution. However, with the advent of CompletableFuture in JDK 8, the way opened from callback hell to clean and more functional code. We look at practical examples of the challenges CompletableFuture ‘with streams and lambdas’ takes and about it’s efficiency.",
      "title": "CompletableFuture is here",
      "url": "http://jeeconf.com/program/#completablefuture",
      "startTimestamp": "2015-05-23T08:00:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s37",
      "color": "#646464",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T08:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "mantula"
      ],
      "description": "At the end of 2013, an online course “Functional Programming in Scala” by Martin Odersky caught buzz among my friends-java-developers. After graduating the course with honours, I have decided that I can easily cope with any Scala-based project. But the reality appeared not so colourful. In my lecture I’m going to show some pros and cons of Scala with examples from real life. I’ll tell you about the perks Scala provides us with, and traps that can turn our lives into hell. I will show the elegance of Scala, explain how different perception of elegance can be, and how it can end up. My lecture might be especially interesting for those who are already familiar with the syntax of the language, but did not have a chance to work with it in real projects.",
      "title": "Scala Rock-Painting",
      "url": "http://jeeconf.com/program/#scala-rock-painting",
      "startTimestamp": "2015-05-23T08:00:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s38",
      "color": "#646464",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T08:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "kraus"
      ],
      "description": "As a software developer you are not very often in the situation where you develop a completely new system from scratch based on recent techonologies. More often just small features have to be integrated in already existing systems. A change of the basic software architecture and an introduction of new programming paradigms are very difficult in this context. It is all the more important to make the modernization of a legacy systems an ongoing part of the feature-driven development process. In this talk I will show step by step how to transform a big, monolithic legacy system towards a modern microservice based architecture. And I will demonstrate how two open libraries from Netflix can support this process. Hystrix will help us to improve the overall stability of the system and RxJava will help us to handle asynchronous processes in a more elegant way. Based on examples I will show how the suggested modernization process could be realised.",
      "title": "The modernization of legacy systems with microservices, Hystrix and RxJava",
      "url": "http://jeeconf.com/program/#microservices-with-hystrix-and-rxjava",
      "startTimestamp": "2015-05-23T08:00:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s39",
      "color": "#646464",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T08:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "long",
        "borisov",
        "sadogursky",
        "alimenkou"
      ],
      "description": "Spring Q&A Panel",
      "title": "Spring Q&A Panel",
      "url": "",
      "startTimestamp": "2015-05-23T08:00:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s40",
      "color": "#646464",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T08:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "warburton"
      ],
      "description": "Generics are one of the most complex features of Java. They are often poorly understood and lead to confusing errors. Unfortunately, it won’t get easier. Java 10, release planned for 2018, extends Generics. It’s now time to understand generics or risk being left behind. We start by stepping back into the halcyon days of 2004 and explain why generics were introduced in the first place back. We also explain why Java’s implementation is unique compared to similar features in other programming languages. Then we travel to the present to explaining how to make effective use of Generics. We then explore various entertaining code examples and puzzlers of how Generics are used today. Finally, this talk sheds light on the planned changes in Java 10 with practical code examples and related ideas from other programming languages. If you ever wanted to understand the buzz around higher kinded types or declaration site variance now is your chance!",
      "title": "Java Generics: Past, Present and Future",
      "url": "http://jeeconf.com/program/#java-generics",
      "startTimestamp": "2015-05-23T09:00:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s41",
      "color": "#646464",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "salnikov-tarnovski"
      ],
      "description": "Automatic memory management and garbage collection is one of the biggest advantages of JVM compared with previous platforms. But it has a price: GC overhead and pauses. When every millisecond counts this price can be too high. You can get away and not pay it by taking responsibility back into your hands. I will describe what does “off-heap” memory means for java application developer and how he can use it in order to speed his application up. The majority of this talk is live code demonstration. I will use different ways to implement off-heap data storage and will show how fast one and the same piece of code runs with each implementation.",
      "title": "Heap, off you go",
      "url": "http://jeeconf.com/program/#heap-off-you-go",
      "startTimestamp": "2015-05-23T09:00:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s42",
      "color": "#646464",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "sadogursky",
        "egorov"
      ],
      "description": " In this session we will talk about Groovy compile-time metaprogramming: the AST transformations. Those are the wizards that improve, check and manipulate your code in compile time, allowing you to keep your source nice, tide and readable. In the first part of the presentation, Baruch will show you what Groovy has to offer out of the box in this regard (and it’s A LOT!) and then Sergei will teach you how to unleash the power of AST to create your own magic by writing custom AST transformations, tailored to your business needs.",
      "title": "Groovy under Macroscope",
      "url": "http://jeeconf.com/program/#groovy-under-macroscope",
      "startTimestamp": "2015-05-23T09:00:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s43",
      "color": "#646464",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "long"
      ],
      "description": "The promise of the cloud is the reduction of friction between development and deployment. It’s continuous delivery. It’s the ability to think about apps, not kernels. In this talk, we’ll look at how Cloud Foundry, the open-source PaaS from the Linux Foundation that underpins IBM’s BlueMix and HP’s Helion products, and serves large users like Baidu and NTT, can be used to deploy, scale, auto-heal, monitor and analyze applications. We’ll look at how to use the API to master your runtime and we’ll also look at the next generation of Cloud Foundry, code-named Lattice, and its Docker-first support.",
      "title": "What’s In Your Cloud?",
      "url": "http://jeeconf.com/program/#what-is-in-your-cloud",
      "startTimestamp": "2015-05-23T09:00:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s44",
      "color": "#646464",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T09:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "kozhaev"
      ],
      "description": "Xtext is a new framework for developing parsers for your DSL language linked with power of the Eclipse platform. During this talk I will show how advantages of this tool can help as to build powerful IDE for own DSL language during just one day.",
      "title": "How to write IDE for your DSL in one day",
      "url": "http://jeeconf.com/program/#ide-for-dsl",
      "startTimestamp": "2015-05-23T08:00:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s45",
      "color": "#646464",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T08:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "borisov"
      ],
      "description": "Have you ever migrated from one database to another or needed to change ORM? Have you ever moved from relational database to NoSQL. Or maybe you worked on projects which had a combination of both of them above and planned to introduce additional database? How much did you suffered trying to save your infrastructure features? In the current session, I’ll show you how you can reduce the pain by using Spring Data.",
      "title": "Spring Data, ta da!",
      "url": "http://jeeconf.com/program/#spring-data",
      "startTimestamp": "2015-05-23T11:30:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s45",
      "color": "#646464",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T12:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "polischuk"
      ],
      "description": "Through years of work have been trying many of Java frameworks which provides different level of abstractions on both server and client-side. Pure Servlet+JSP, JSF, GWT, Struts, Spring MVC, Vaadin, Play!, DWR, you name it. Sometimes it felt good, sometimes not, and with each year number of “good” applications reduced to the critical minimum. Later I tried to bring all the good points I had ever seen together to create “a perfect being” and after years of struggling I feel that I have reached the goal. Let me share it…",
      "title": "Web-application I have always dreamt of",
      "url": "http://jeeconf.com/program/#ideal-web-application",
      "startTimestamp": "2015-05-23T11:30:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s46",
      "color": "#646464",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T12:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "laskowski"
      ],
      "description": "The presentation is going to introduce you to the available concurrency abstractions available for Scala developers – Rx’s Observables, scala.concurrent.Future, and Akka’s actors. It’s going to be a Scala code-heavy presentation. However Scala is the language of choice the libraries are not limited to the Scala language and Java API is either the main research language with Scala’s as an alternative or yet another API.",
      "title": "About concurrency abstractions with Observable’s, Future’s, Akka (actors) in Scala",
      "url": "http://jeeconf.com/program/#concurrency-abstractions-in-scala",
      "startTimestamp": "2015-05-23T11:30:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s47",
      "color": "#646464",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T12:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "khotin"
      ],
      "description": "In this talk we will cover a new trend in distributed enterprise architecture – microservices. How the leading technology companies like Netflix and Amazon come to use that approach. How does it help them to scale their infrastructure. And how the newest set of tools in the Spring family would help you to apply those design principles in practice. Spring has always been about patterns and Spring Cloud brings you implementation of several widespread ones for distributed apps. We will talk about the problems we’ve encountered while trying to move our projects in cloud, what pain Spring Cloud promises to fix, how it fits the new cloud world vision. And what should come first – DevOps or Microservices.",
      "title": "App infrastructure for microservices with Spring Cloud 1.0.0",
      "url": "http://jeeconf.com/program/#infrastructure-for-microservices-with-spring-cloud",
      "startTimestamp": "2015-05-23T11:30:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s48",
      "color": "#646464",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T12:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "semeniuk"
      ],
      "description": "Encapsulating functionality: Web Components – set of new standards from Google. It’s time to adopt or maybe look back? It’s seems, we have had something similar, or it is absolutely different? JSF components – Oh, no! Or give a chance? Go forward to a client’s browser or review new features in server? How to start using Polymer under Spring Boot or maybe it will be PrimeFaces. Glance from back-end (and slightly manager) perspectives.",
      "title": "Less JS! Web components for back-end developers.",
      "url": "http://jeeconf.com/program/#less-js",
      "startTimestamp": "2015-05-23T11:30:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s49",
      "color": "#646464",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T12:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "smirnov"
      ],
      "description": "Suppose you want to have a general understanding of how the performance changes when you add a new JVM argument. For instance, you develop an agent, and you want to make sure that the clients’ performance does not suffer when it’s attached. Or you want to see if it is a good idea to enable a JVM option by default. There are surprisingly many ways to do it wrong. The talk will cover some of them and discuss the general problem of benchmark suites for Java.",
      "title": "Side-By-Side Performance Comparisons",
      "url": "http://jeeconf.com/program/#performance-comparisons",
      "startTimestamp": "2015-05-23T12:30:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s50",
      "color": "#646464",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T13:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "köbler"
      ],
      "description": "Node.js (or I/O.js) as an evented I/O runtime is very popular and is used widely. But how do you integrate Node in enterprise architectures? There are mature monitoring processes for JVM runtime environments and a significant part of the business logic is implemented in Java libraries. In addition, JavaScript code execution in Node.js is only single threaded, is it worth at all? The seamless integration and a (nearly complete) compatibility to Node.js applications in JVM environments promise Nodyn from RedHat, but it’s using alternative JavaScript engines from V8 like Nashorn and DynJS; additionally there’s Netty and Vert.x. This approach deals with the ability to be able to execute JavaScript code not only non-blocking and asynchronously, but also in highly distributed environments using the Vert.x Eventbus. Additionally, there are other advantages of using a JVM-based scripting engine when developing for enterprise environments. Come and see my Beer-as-a-Service in action!",
      "title": "Node.js and Evented I/O Alternatives on the JVM",
      "url": "http://jeeconf.com/program/#event-io-jvm-alternatives-to-nodejs",
      "startTimestamp": "2015-05-23T12:30:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s51",
      "color": "#646464",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T13:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "podkhalyuzin"
      ],
      "description": "Scala can be really complicated, and it’s normal that you don’t know how to start learning it. So it really simple to miss possibilities for the beginners to learn Scala effectively. This talk is about what tools and practices can be used for the beginners. We will observe Scala Worksheet and its practices. We also will make a review for the most common mistakes in Scala code. Moreover I’ll tell you about refactoring tools and implicits debug tools. This talk will have some introduction to Scala, so any knowledge of this language is not required. All of this will help people, who want to start learning Scala, to do it in more effective way and it also will help people, who already know Scala, to use it in more powerful way.",
      "title": "Productivity in Scala",
      "url": "http://jeeconf.com/program/#productivity-in-scala",
      "startTimestamp": "2015-05-23T12:30:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s52",
      "color": "#646464",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T13:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "nikitchenko"
      ],
      "description": "You run your SQL-centric infrastructure for 10 years and slowly starting to note you can’t do this way anymore – everything is getting too expensive but your business requires things which are simply impossible without radical cahnges. This is exact situation we had 2 years before. So we’d like to shouw our experience: Why and how we came into Big Data? Why we choose Apache and Hadoop? What to do and what is already done? What lessans were learned? Hadoop and relational databases: fight or synergy? Reactive Big Data manifest.",
      "title": "Big Data: from mammoth to elephant – transforming legacy solutions with Hadoop infrastructure",
      "url": "http://jeeconf.com/program/#from-legacy-to-hadoop",
      "startTimestamp": "2015-05-23T12:30:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s53",
      "color": "#646464",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T13:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "morenets"
      ],
      "description": "One of the most frequent tasks in software development is deployment and configuration of applications. Spring Boot is modern framework that allows to simplify and speed up both tasks bringing standards and rules in the development process.",
      "title": "Spring Boot. Boot up your development",
      "url": "http://jeeconf.com/program/#spring-boot",
      "startTimestamp": "2015-05-23T12:30:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s54",
      "color": "#646464",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T13:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "alimenkou"
      ],
      "description": "JMS is known as standard way to implement distributed work with messaging in Java world. There are many JMS providers, both open source and commercial. Large percent of developers use JMS for almost every case when they want to sent message and process it on the other side. But now there are many alternative solutions to organize message queues: AMQP, Redis, ZooKeeper, Apache Kafka or even custom solutions based on Cassandra. Why not to use them instead of JMS? In this talk we will discuss key “issues” in any messaging system and then with this knowledge in mind look once again at JMS and alternative approaches using practical cases from my experience. May be after this talk some more people will stop using JMS and start using their mind. :)",
      "title": "Do we need JMS in 21st century?",
      "url": "http://jeeconf.com/program/#do-we-need-jms",
      "startTimestamp": "2015-05-23T14:00:00Z",
      "tags": [
        "TOPIC_GENERAL_TOPICS"
      ],
      "mainTag": "TOPIC_GENERAL_TOPICS",
      "id": "s55",
      "color": "#646464",
      "room": "track-a",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T14:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "chashnikov"
      ],
      "description": "Developers want to make very few errors in their code and to spot them as early as possible: with the help of unit tests, or earlier, during compilation, or best of all, immediately after they typed something wrong in their IDE. This is what static code analyzers are for. Some of them are built-in, others need to be run separately, some check just about any code, the others require it to be annotated first, and there are tools that are a little bit of all. Do the ends justify the means? Is it even worth trying? What kind of errors can be spotted by static code analysis? How sure can we be if what an analyzer gives us is a real error or a false positive? This talk hopefully helps you answer these questions.",
      "title": "Write code faster with fewer errors: is it possible?",
      "url": "http://jeeconf.com/program/#write-code-faster-with-fewer-errors",
      "startTimestamp": "2015-05-23T14:00:00Z",
      "tags": [
        "TOPIC_JDK_WEB"
      ],
      "mainTag": "TOPIC_JDK_WEB",
      "id": "s56",
      "color": "#646464",
      "room": "track-b",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T14:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "sadogursky",
        "borisov"
      ],
      "description": "More strange, more bizarre, more fun! The Groovy Puzzlers hits with its second season in which we implemented the lesson learned from the first one – do more of the same (always as a duet)! Expect even more “NO WAY!”, “WHOA!”, “WTF!”, O_o and prizes flying around, and expect to learn more about Groovy’s darkest secrets! As usual, the traps we fell into here in JFrog and contributions from top-notch Groovy authors and users!",
      "title": "The Epic Groovy Puzzlers [Season 2]: The revenge of the parentheses",
      "url": "http://jeeconf.com/program/#groovy-puzzlers",
      "startTimestamp": "2015-05-23T14:00:00Z",
      "tags": [
        "TOPIC_JVM_LANGUAGES"
      ],
      "mainTag": "TOPIC_JVM_LANGUAGES",
      "id": "s57",
      "color": "#646464",
      "room": "track-c",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T14:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "moisieienko"
      ],
      "description": "The main topic of talk is building high availability high throughput system for receiveing and saving different kind of information with horizontal scalling possibility using HBase, Flume and Grizzly hosted on Amazon EC2 low cost instances. Talk describes HBase HA cluster setup process with useful hints and EC2 pitfalls, Flume setup process with providing comparasion between standalone and embedded Flume versions and show difference and usecases of both versions. A lot of attention payed to Flume2Hbase streaming features with tweaks and different approaches for speeding up this process. The data entry point example showed with using light Grizzly Server. Presentation contains real life metrics, useful approaches and hints.",
      "title": "How to Manage 10K request per second in HA manner",
      "url": "http://jeeconf.com/program/#10K-requests-per-second-in-ha-manner",
      "startTimestamp": "2015-05-23T14:00:00Z",
      "tags": [
        "TOPIC_BIGDATACLOUDS"
      ],
      "mainTag": "TOPIC_BIGDATACLOUDS",
      "id": "s58",
      "color": "#646464",
      "room": "track-d",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T14:45:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": [
        "fränkel"
      ],
      "description": "Unit testing ensures your production code is relevant. But what does ensure your testing code is relevant? Come discover mutation testing and make sure your never forget another assert again. In the realm of testing, the code coverage metrics is the most often talked about. However, it doesn’t mean that the test has been useful or even that an assert has been coded. Mutation testing is a strategy to make sure that the test code is relevant. In this talk, I will explain how Code Coverage is computed and what its inherent flaw is. Afterwards, I will describe how Mutation Testing work and how it helps pointing out code that is tested but leave out corner cases. I will also demo PIT, a Java production-grade framework that enables Mutation Testing on a simple code base. If time allows, a demo will also show how PIT can be integrated with SonarQube.",
      "title": "Improve your tests quality with Mutation Testing",
      "url": "http://jeeconf.com/program/#mutation-testing",
      "startTimestamp": "2015-05-23T14:00:00Z",
      "tags": [
        "TOPIC_TOOLS_APPROACHES"
      ],
      "mainTag": "TOPIC_TOOLS_APPROACHES",
      "id": "s59",
      "color": "#646464",
      "room": "track-e",
      "hashtag": "",
      "isLivestream": false,
      "endTimestamp": "2015-05-23T14:45:00Z",
      "captionsUrl": ""
    }
  ],
  "hashtags": [
    {
      "color": "#303f9f",
      "order": 1,
      "name": "#io14",
      "description": "Follow the general Google+ social conversation happening around I/O 2014."
    },
    {
      "color": "#9fa8da",
      "order": 10,
      "name": "#io14 #Keynote",
      "description": "Follow the Google+ social conversation about the Keynote announcements at I/O 2014."
    },
    {
      "color": "#ff8a65",
      "order": 11,
      "name": "#io14extended",
      "description": "Experience the magic of I/O remotely through locally organized events and follow what's happening at other I/O Extended events around the world."
    },
    {
      "color": "#f9a825",
      "order": 12,
      "name": "#io14request",
      "description": "Users not able to attend I/O in-person are invited to request images, info, and answers to questions about all things I/O by using this hashtag on Google+."
    },
    {
      "color": "#4dd0e1",
      "order": 13,
      "name": "#io14photoblog",
      "description": "Follow the story of what's happening at the Moscone Center through photos taken by onsite Community Managers."
    },
    {
      "color": "#9ccc65",
      "order": 14,
      "name": "#iohunt",
      "description": "Google I/O Hunt is a location-based game available at I/O 2014 where attendees are challenged to find hidden NFC tags, answer trivia questions, and complete fun challenges."
    },
    {
      "color": "#80cbc4",
      "order": 15,
      "name": "#io14 #AfterHours",
      "description": "Check out the highlights of the After Hours, this year with a taste of San Francisco: a beer garden, food trucks, local indie bands, and more."
    },
    {
      "color": "#3f51b5",
      "order": 20,
      "name": "#io14 #Design",
      "description": "Follow the Google+ social conversation about \"Design\" at I/O 2014."
    },
    {
      "color": "#03a9f4",
      "order": 21,
      "name": "#io14 #Develop",
      "description": "Follow the Google+ social conversation about \"Develop\" at I/O 2014."
    },
    {
      "color": "#e91e63",
      "order": 22,
      "name": "#io14 #Distribute",
      "description": "Follow the Google+ social conversation about \"Distribute\" at I/O 2014."
    },
    {
      "color": "#646464",
      "order": 30,
      "name": "#io14 #Accessibility",
      "description": "Follow the Google+ social conversation about \"Accessibility\" at I/O 2014."
    },
    {
      "color": "#558b2f",
      "order": 31,
      "name": "#io14 #Android",
      "description": "Follow the Google+ social conversation about \"Android\" at I/O 2014."
    },
    {
      "color": "#3367d6",
      "order": 32,
      "name": "#io14 #Chrome",
      "description": "Follow the Google+ social conversation about \"Chrome\" at I/O 2014."
    },
    {
      "color": "#0288d1",
      "order": 33,
      "name": "#io14 #Cloud",
      "description": "Follow the Google+ social conversation about \"Cloud\" at I/O 2014."
    },
    {
      "color": "#00838f",
      "order": 34,
      "name": "#io14 #Dart",
      "description": "Follow the Google+ social conversation about \"Dart\" at I/O 2014."
    },
    {
      "color": "#b93221",
      "order": 35,
      "name": "#io14 #Games",
      "description": "Follow the Google+ social conversation about \"Games\" at I/O 2014."
    },
    {
      "color": "#2a56c6",
      "order": 36,
      "name": "#io14 #Go",
      "description": "Follow the Google+ social conversation about \"Go\" at I/O 2014."
    },
    {
      "color": "#c3570b",
      "order": 37,
      "name": "#io14 #Growth",
      "description": "Follow the Google+ social conversation about \"Growth\" at I/O 2014."
    },
    {
      "color": "#795548",
      "order": 38,
      "name": "#io14 #Location",
      "description": "Follow the Google+ social conversation about \"Location\" at I/O 2014."
    },
    {
      "color": "#0d904f",
      "order": 39,
      "name": "#io14 #Monetization",
      "description": "Follow the Google+ social conversation about \"Monetization\" at I/O 2014."
    },
    {
      "color": "#ce4319",
      "order": 40,
      "name": "#io14 #Media",
      "description": "Follow the Google+ social conversation about \"Media\" at I/O 2014."
    },
    {
      "color": "#8e24aa",
      "order": 41,
      "name": "#io14 #Performance",
      "description": "Follow the Google+ social conversation about \"Performance\" at I/O 2014."
    },
    {
      "color": "#673ab7",
      "order": 42,
      "name": "#io14 #Polymer",
      "description": "Follow the Google+ social conversation about \"Polymer\" at I/O 2014."
    },
    {
      "color": "#607d8b",
      "order": 43,
      "name": "#io14 #Tools",
      "description": "Follow the Google+ social conversation about \"Tools\" at I/O 2014."
    },
    {
      "color": "#00897b",
      "order": 44,
      "name": "#io14 #UX",
      "description": "Follow the Google+ social conversation about \"UX\" at I/O 2014."
    },
    {
      "color": "#ad1457",
      "order": 45,
      "name": "#io14 #Wearables",
      "description": "Follow the Google+ social conversation about \"Wearables\" at I/O 2014."
    }
  ],
  "experts": [],
  "rooms": [
    {
      "original_id": "track-a1",
      "id": "track-a",
      "name": "GENERAL TOPICS"
    },
    {
      "original_id": "track-b1",
      "id": "track-b",
      "name": "JDK/WEB"
    },
    {
      "original_id": "track-c1",
      "id": "track-c",
      "name": "JVM LANGUAGES"
    },
    {
      "original_id": "track-d1",
      "id": "track-d",
      "name": "BIG DATA/CLOUD"
    },
    {
      "original_id": "track-e1",
      "id": "track-e",
      "name": "TOOLS/APPROACHES"
    }
  ],
  "tags": [
    {
      "category": "TOPIC",
      "name": "General Topics",
      "color": "#607d8b",
      "abstract": "",
      "tag": "TOPIC_GENERAL_TOPICS",
      "original_id": "general-topics",
      "order_in_category": 1
    },
    {
      "category": "TOPIC",
      "name": "Big Data/Clouds",
      "color": "#0288d1",
      "abstract": "",
      "tag": "TOPIC_BIGDATACLOUDS",
      "original_id": "big-data-clouds",
      "hashtag": "Cloud",
      "order_in_category": 2
    },
    {
      "category": "TOPIC",
      "name": "JDK/WEB",
      "color": "#646464",
      "abstract": "",
      "tag": "TOPIC_JDK_WEB",
      "original_id": "jdk-web",
      "order_in_category": 3
    },
    {
      "category": "TOPIC",
      "name": "JVM Languages",
      "color": "#2a56c6",
      "abstract": "",
      "tag": "TOPIC_JVM_LANGUAGES",
      "original_id": "jvm-languages",
      "order_in_category": 4
    },
    {
      "category": "TOPIC",
      "name": "Tools/Approaches",
      "color": "#00838f",
      "abstract": "",
      "tag": "TOPIC_TOOLS_APPROACHES",
      "original_id": "tools-approaches",
      "order_in_category": 5
    }
  ]
}